# Subsetting and Descriptive Stats

## Before your start:
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
import pandas as pd
import numpy as np
import math

# Challenge 1
#### In this challenge we will use the `temp_states`  dataset. 

#### First import it into a dataframe called `temp`.

In [2]:
tempdata = pd.read_csv('Temp_States.csv')

#### Print `temp`.

In [3]:
tempdata.head()

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [4]:
tempdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   City         7 non-null      object
 1   State        7 non-null      object
 2   Temperature  7 non-null      float64
dtypes: float64(1), object(2)
memory usage: 296.0+ bytes

In [5]:
# We have two categorical variables (City and State) and one numerical (Temperature)

#### Select the rows where state is New York.

In [6]:
tempdata[(tempdata['State']=='New York')]

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [52]:
tempdata_ny=tempdata[(tempdata['State']=='New York')]
tdnymean = tempdata_ny['Temperature'].mean()
print('The mean temperature of New York is: ', tdnymean)

The mean temperature of New York is:  10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [8]:
tempdata[(tempdata['Temperature']>15)]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [9]:
tempdata_over_15=tempdata[(tempdata['Temperature']>15)]
tempdata_over_15[('City')]

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [10]:
tempdata1520 = tempdata[(tempdata['Temperature']>15) & (tempdata['Temperature']<20)]
tempdata1520

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222

#### Find the mean and standard deviation of the temperature of each state.

In [51]:
#New York
tdnymean = tempdata_ny['Temperature'].mean()
tdnysdev = tempdata_ny['Temperature'].std()
#Connecticut
tempdata_ct = tempdata[(tempdata['State']=='Connecticut')]
tdctmean = tempdata_ct['Temperature'].mean()
tdctsdev = tempdata_ct['Temperature'].std()

print('The mean temperature of New York is: ', tdnymean)
print('The standard deviation of the temperature of New York is: ', tdnysdev)
print('The mean temperature of Connecticut is: ', tdctmean)
print('The standard deviation of the temperature of Connecticut is: ', tdctsdev)

The mean temperature of New York is:  10.74074074074074
The standard deviation of the temperature of New York is:  8.133404168888054
The mean temperature of Connecticut is:  15.833333333333332
The standard deviation of the temperature of Connecticut is:  1.9641855032959645

# Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [99]:
empdata = pd.read_csv('Employee.csv') 
empdata.head()

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

##### Explore the data types of the `employees` dataframe. Comment your results.

In [56]:
empdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        9 non-null      object
 1   Department  9 non-null      object
 2   Education   9 non-null      object
 3   Gender      9 non-null      object
 4   Title       9 non-null      object
 5   Years       9 non-null      int64
 6   Salary      9 non-null      int64
dtypes: int64(2), object(5)
memory usage: 632.0+ bytes

In [58]:
"""
5 columns are categorical variables: Name, Department, Education, Gender and Title. One of those, Gender, is a dummy M-F. 
The other two, Years and Salary, are integers. 
"""

'\n5 columns are categorical variables: Name, Department, Education, Gender and Title. One of those, Gender, is a dummy M-F. \nThe other two, Years and Salary, are integers. \n'

#### What's the average salary in this company?

In [66]:
avg_salary = empdata['Salary'].mean()
print('The average salary of this company is', avg_salary)

The average salary of this company is 48.888888888888886

#### What's the highest salary?

In [65]:
max_salary = empdata['Salary'].max()
print('The highest salary of this company is', max_salary)

The highest salary of this company is 70

#### What's the lowest salary?

In [67]:
min_salary = empdata['Salary'].min()
print('The lowest salary of this company is', min_salary)

The lowest salary of this company is 30

#### Who are the employees with the lowest salary?

In [69]:
min_salary_emps = empdata[(empdata['Salary']==30)]
min_salary_emps[('Name')]

1    Maria
2    David
Name: Name, dtype: object

#### Find all the information about an employee called David.

In [70]:
empdata[(empdata['Name']=='David')]

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [71]:
empdata_david = empdata[(empdata['Name']=='David')]
empdata_david[('Salary')]

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [73]:
empdata[(empdata['Title']=='associate')]

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [74]:
empdata.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [75]:
print(empdata.iloc[:3])

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [78]:
emp_ass_55 = empdata[(empdata['Title']=='associate') & (empdata['Salary']==55)]
emp_ass_55

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [94]:
empdata_years= empdata.groupby(['Years'])
avg_salary_years = empdata_years['Salary'].mean()
print('The average salary by years of employment is')
print(avg_salary_years)

The average salary by years of employment is
Years
1    35.000000
2    38.333333
3    55.000000
4    35.000000
7    60.000000
8    70.000000
Name: Salary, dtype: float64

####  What is the average salary per title?

In [95]:
empdata_title= empdata.groupby(['Title'])
avg_salary_title = empdata_title['Salary'].mean()
print('The average salary by title is')
print(avg_salary_title)

The average salary by title is
Title
VP           70.000000
analyst      32.500000
associate    56.666667
Name: Salary, dtype: float64

####  Find the salary quartiles.

In [88]:
empdata['Salary'].quantile([0.25, 0.75])

0.25    35.0
0.75    60.0
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [91]:
empdata_gender= empdata.groupby(['Gender'])
avg_salary_gender = empdata_gender['Salary'].mean()
print('The average salary by gender is') 
print(avg_salary_gender)
print('Male average salary is 2.5 higher than female')

The average salary by gender is
Gender
F    47.5
M    50.0
Name: Salary, dtype: float64
Male average salary is 2.5 higher than female

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [104]:
emp_numeric = empdata._get_numeric_data()
emp_numeric.describe()
#IT
empit = empdata[(empdata['Department']=='IT')]
#HR
emphr = empdata[(empdata['Department']=='HR')]
#Sales
empsales = empdata[(empdata['Department']=='Sales')]

In [106]:
print('Descriptive Statistics of the IT department are:')
emp_num_it = empit._get_numeric_data()
emp_num_it.describe()

Descriptive Statistics of the IT department are:

          Years    Salary
count  4.000000   4.00000
mean   4.500000  48.75000
std    3.511885  19.31105
min    1.000000  30.00000
25%    1.750000  33.75000
50%    4.500000  47.50000
75%    7.250000  62.50000
max    8.000000  70.00000

In [108]:
print('Descriptive Statistics of the HR department are:')
emp_num_hr = emphr._get_numeric_data()
emp_num_hr.describe()

Descriptive Statistics of the HR department are:

          Years     Salary
count  3.000000   3.000000
mean   4.666667  45.000000
std    3.055050  21.794495
min    2.000000  30.000000
25%    3.000000  32.500000
50%    4.000000  35.000000
75%    6.000000  52.500000
max    8.000000  70.000000

In [109]:
print('Descriptive Statistics of the Sales department are:')
emp_num_sales = empsales._get_numeric_data()
emp_num_sales.describe()

Descriptive Statistics of the Sales department are:

          Years  Salary
count  2.000000     2.0
mean   2.500000    55.0
std    0.707107     0.0
min    2.000000    55.0
25%    2.250000    55.0
50%    2.500000    55.0
75%    2.750000    55.0
max    3.000000    55.0

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [30]:
# your code here

# Challenge 3
#### Open the `orders` dataset. Name your dataset `orders`.

In [31]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [32]:
# your code here

In [33]:
"""
your comments here
"""

'\nyour comments here\n'

####  What is the average purchase price?

In [34]:
# your code here

#### What are the highest and lowest purchase prices?

In [35]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [36]:
# your code here

#### How many customers do we have in Spain?

In [37]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [38]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [39]:
# your code here

#### Select all free orders.

In [40]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [41]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [42]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [43]:
# your code here

#### Select all orders made in the month of August.

In [44]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [45]:
# your code here

#### What's the  average amount of money spent by country?

In [46]:
# your code here

#### What's the most expensive item?

In [47]:
# your code here

#### What is the average amount spent per year?

In [48]:
# your code here